УТ_для_edt/src/InformationRegisters/смартДополнительныеСтатусыГарантийныхЗапчастей/смартДополнительныеСтатусыГарантийныхЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДополнительныеСтатусыГарантийныхЗапчастей</name>
  <comment>// смарт:ММ #044 224 137 30.03.2020</comment>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартДополнительныеСтатусыПоГарантии</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерОтслеживания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дилер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьРешениеПоставщика</name>
    <type>
      <types>EnumRef.УдалитьсмартРешенияПоставщикаExcel</types>
    </type>
  </resources>
  <resources>
    <name>РешениеПоставщика</name>
    <type>
      <types>EnumRef.смартРешенияПоставщика</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиВФайле</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартДополнительныеСтатусыГарантийныхЗапчастей/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
// События формы и элементов

#Область СобытияФормыИЭлементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоПоследниеИзменения") = Истина Тогда
		ТолькоПоследниеИзменения = Параметры.ТолькоПоследниеИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборТолькоПоследниеИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПоследниеИзмененияПриИзменении(Элемент)
	
	УстановитьОтборТолькоПоследниеИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписиДоДаты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УдалитьЗаписиДоДатыЗакрытиеФормы", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.смартДополнительныеСтатусыГарантийныхЗапчастей.Форма.ФормаВводаДатыУдаления",, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписиДоДатыЗакрытиеФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		УдалитьЗаписиИзРегистра(РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиИзРегистра(ДатаУдаления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартДополнительныеСтатусыГарантийныхЗапчастей.ДатаЗагрузки КАК ДатаЗагрузки,
	|	смартДополнительныеСтатусыГарантийныхЗапчастей.НомерЗаявки КАК НомерЗаявки,
	|	смартДополнительныеСтатусыГарантийныхЗапчастей.Артикул КАК Артикул
	|ИЗ
	|	РегистрСведений.смартДополнительныеСтатусыГарантийныхЗапчастей КАК смартДополнительныеСтатусыГарантийныхЗапчастей
	|ГДЕ
	|	смартДополнительныеСтатусыГарантийныхЗапчастей.ДатаЗагрузки < &ДатаУдаления";
	
	Запрос.УстановитьПараметр("ДатаУдаления", ДатаУдаления);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	УдаленоЗаписей = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.смартДополнительныеСтатусыГарантийныхЗапчастей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаЗагрузки.Установить(Выборка.ДатаЗагрузки);
		НаборЗаписей.Отбор.НомерЗаявки.Установить(Выборка.НомерЗаявки);
		НаборЗаписей.Отбор.Артикул.Установить(Выборка.Артикул);
		НаборЗаписей.Прочитать();
		
		УдаленоЗаписей = УдаленоЗаписей + НаборЗаписей.Количество();
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЦикла;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Удалено записей: " + УдаленоЗаписей);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборТолькоПоследниеИзменения()
	
	Если ТолькоПоследниеИзменения Тогда
		ПоследняяДатаЗагрузки = ПолучитьПоследнююДатуЗагрузки();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаЗагрузки", ПоследняяДатаЗагрузки);		
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ДатаЗагрузки");		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююДатуЗагрузки()
	
	ДатаВозврата = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(смартДополнительныеСтатусыГарантийныхЗапчастей.ДатаЗагрузки) КАК ДатаЗагрузки
	|ИЗ
	|	РегистрСведений.смартДополнительныеСтатусыГарантийныхЗапчастей КАК смартДополнительныеСтатусыГарантийныхЗапчастей";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаВозврата = Выборка.ДатаЗагрузки;
	КонецЕсли;
	
	Возврат ДатаВозврата;
	
КонецФункции

#КонецОбласти
